app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
  def index
    @candies = Candy.all

INSERT INTO "candies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sweet"], ["created_at", "2020-08-12 17:58:08.824176"], ["updated_at", "2020-08-12 17:58:08.824176"]]
---
  def create
    @candy = Candy.new(candy_params)

    respond_to do |format|
      if @candy.save

SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_candy
      @candy = Candy.find(params[:id])